OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ehci-hcd.c
/*
 * Enhanced Host Controller Interface (EHCI) driver for USB.
 *
 * Maintainer: Alan Stern <stern@rowland.harvard.edu>
 *
 * Copyright (c) 2000-2004 by David Brownell
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the
 * Free Software Foundation; either version 2 of the License, or (at your
 * option) any later version.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "M480.h"

#include "usb.h"


/*-------------------------------------------------------------------------*/

/*
 * EHCI hc_driver implementation ... experimental, incomplete.
 * Based on the final 1.0 register interface specification.
 *
 * USB 2.0 shows up in upcoming www.pcmcia.org technology.
 * First was PCMCIA, like ISA; then CardBus, which is PCI.
 * Next comes "CardBay", using USB 2.0 signals.
 *
 * Contains additional contributions by Brad Hards, Rory Bolt, and others.
 * Special thanks to Intel and VIA for providing host controllers to
 * test this driver on, and Cypress (including In-System Design) for
 * providing early devices for those host controllers to talk to!
 */

#define DRIVER_AUTHOR "David Brownell"
#define DRIVER_DESC "USB 2.0 'Enhanced' Host Controller (EHCI) Driver"

static const char   hcd_name [] = "ehci_hcd";

struct ehci_hcd  *g_m480_ehci;

#undef VERBOSE_DEBUG
#undef EHCI_URB_TRACE

#ifdef DEBUG
#define EHCI_STATS
#endif

/* magic numbers that can affect system performance */
#define EHCI_TUNE_CERR      3   /* 0-3 qtd retries; 0 == don't stop */
#define EHCI_TUNE_RL_HS     4   /* nak throttle; see 4.9 */
#define EHCI_TUNE_RL_TT     0
#define EHCI_TUNE_MULT_HS   1   /* 1-3 transactions/uframe; 4.10.3 */
#define EHCI_TUNE_MULT_TT   1
/*
 * Some drivers think it's safe to schedule isochronous transfers more than
 * 256 ms into the future (partly as a result of an old bug in the scheduling
 * code).  In an attempt to avoid trouble, we will use a minimum scheduling
 * length of 512 frames instead of 256.
 */
#define EHCI_TUNE_FLS       1   /* (medium) 512-frame schedule */

#define EHCI_IAA_MSECS      10      /* arbitrary */
#define EHCI_IO_JIFFIES     (HZ/10)     /* io watchdog > irq_thresh */
#define EHCI_ASYNC_JIFFIES  (HZ/20)     /* async idle timeout */
#define EHCI_SHRINK_JIFFIES (DIV_ROUND_UP(HZ, 200) + 1)
/* 5-ms async qh unlink delay */

/* Initial IRQ latency:  faster than hw default */
static int log2_irq_thresh = 0;     // 0 to 6
//module_param (log2_irq_thresh, int, S_IRUGO);
//MODULE_PARM_DESC (log2_irq_thresh, "log2 IRQ latency, 1-64 microframes");

/* initial park setting:  slower than hw default */
static unsigned park = 0;
//module_param (park, uint, S_IRUGO);
//MODULE_PARM_DESC (park, "park setting; 1-3 back-to-back async packets");

/* for flakey hardware, ignore overcurrent indicators */
static int ignore_oc = 0;
//module_param (ignore_oc, bool, S_IRUGO);
//MODULE_PARM_DESC (ignore_oc, "ignore bogus hardware overcurrent indications");

/* for link power management(LPM) feature */
static unsigned int hird;
//module_param(hird, int, S_IRUGO);
//MODULE_PARM_DESC(hird, "host initiated resume duration, +1 for each 75us");

//#define   INTR_MASK (STS_IAA | STS_FATAL | STS_PCD | STS_ERR | STS_INT)
#define INTR_MASK (STS_IAA | STS_FATAL | STS_ERR | STS_INT)

/*-------------------------------------------------------------------------*/

#include "ehci.h"
#include "ehci-dbg.c"
//#include "pci-quirks.h"

/*-------------------------------------------------------------------------*/

#if 0
static void
timer_action(struct ehci_hcd *ehci, enum ehci_timer_action action)
{
    /* Don't override timeouts which shrink or (later) disable
     * the async ring; just the I/O watchdog.  Note that if a
     * SHRINK were pending, OFF would never be requested.
     */
    if (timer_pending(&ehci->watchdog)
            && ((BIT(TIMER_ASYNC_SHRINK) | BIT(TIMER_ASYNC_OFF))
                & ehci->actions))
        return;

    if (!test_and_set_bit(action, &ehci->actions)) {
        unsigned long t;

        switch (action) {
        case TIMER_IO_WATCHDOG:
            if (!ehci->need_io_watchdog)
                return;
            t = EHCI_IO_JIFFIES;
            break;
        case TIMER_ASYNC_OFF:
            t = EHCI_ASYNC_JIFFIES;
            break;
        /* case TIMER_ASYNC_SHRINK: */
        default:
            t = EHCI_SHRINK_JIFFIES;
            break;
        }
        mod_timer(&ehci->watchdog, t + jiffies);
    }
}
#endif

/*-------------------------------------------------------------------------*/

/*
 * handshake - spin reading hc until handshake completes or fails
 * @ptr: address of hc register to be read
 * @mask: bits to look at in result of read
 * @done: value of those bits when handshake succeeds
 * @usec: timeout in microseconds
 *
 * Returns negative errno, or zero on success
 *
 * Success happens when the "mask" bits have the specified value (hardware
 * handshake done).  There are two failure modes:  "usec" have passed (major
 * hardware flakeout), or the register reads as all-ones (hardware removed).
 *
 * That last failure should_only happen in cases like physical cardbus eject
 * before driver shutdown. But it also seems to be caused by bugs in cardbus
 * bridge shutdown:  shutting down the bridge before the devices using it.
 */
static int handshake (struct ehci_hcd *ehci, void __iomem *ptr,
                      u32 mask, u32 done, int usec)
{
    uint32_t        result;
    volatile uint32_t   t0;

    t0 = get_ticks();
    do {
        result = ehci_readl(ehci, ptr);
        if (result == ~(u32)0)      /* card removed */
            return -ENODEV;
        result &= mask;
        if (result == done)
            return 0;
        //udelay (1);
        //usec--;
    } while (get_ticks() - t0 < ((usec + 10000)/10000)); // (usec > 0);
    return -ETIMEDOUT;
}

/* check TDI/ARC silicon is in host mode */
static int tdi_in_host_mode (struct ehci_hcd *ehci)
{
    u32 __iomem *reg_ptr;
    u32     tmp;

