OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ehci-hcd.c
    reg_ptr = (u32 __iomem *)(((u8 __iomem *)ehci->regs) + USBMODE);
    tmp = ehci_readl(ehci, reg_ptr);
    return (tmp & 3) == USBMODE_CM_HC;
}

/* force HC to halt state from unknown (EHCI spec section 2.3) */
static int ehci_halt (struct ehci_hcd *ehci)
{
    u32 temp;

    temp = ehci_readl(ehci, &ehci->regs->status);

    /* disable any irqs left enabled by previous code */
    ehci_writel(ehci, 0, &ehci->regs->intr_enable);

    if (ehci_is_TDI(ehci) && tdi_in_host_mode(ehci) == 0) {
        return 0;
    }

    if ((temp & STS_HALT) != 0)
        return 0;

    temp = ehci_readl(ehci, &ehci->regs->command);
    temp &= ~CMD_RUN;
    ehci_writel(ehci, temp, &ehci->regs->command);
    return handshake (ehci, &ehci->regs->status,
                      STS_HALT, STS_HALT, 16 * 125);
}

static int handshake_on_error_set_halt(struct ehci_hcd *ehci, void __iomem *ptr,
                                       u32 mask, u32 done, int usec)
{
    int error;

    error = handshake(ehci, ptr, mask, done, usec);
    if (error) {
#if 1   // 2016.10.23 - Ignore this problem. HC can still work well.
        error = 0;
#else
        ehci_halt(ehci);
        ehci->rh_state = EHCI_RH_HALTED;
        USB_error("force halt; handshake %p %08x %08x -> %d\n",
                  ptr, mask, done, error);
#endif
    }

    return error;
}

/* put TDI/ARC silicon into EHCI mode */
static void tdi_reset (struct ehci_hcd *ehci)
{
    u32 __iomem *reg_ptr;
    u32     tmp;

    reg_ptr = (u32 __iomem *)(((u8 __iomem *)ehci->regs) + USBMODE);
    tmp = ehci_readl(ehci, reg_ptr);
    tmp |= USBMODE_CM_HC;
    /* The default byte access to MMR space is LE after
     * controller reset. Set the required endian mode
     * for transfer buffers to match the host microprocessor
     */
    if (ehci_big_endian_mmio(ehci))
        tmp |= USBMODE_BE;
    ehci_writel(ehci, tmp, reg_ptr);
}

/* reset a non-running (STS_HALT == 1) controller */
static int ehci_reset (struct ehci_hcd *ehci)
{
    int retval;
    u32 command;

    command = ehci_readl(ehci, &ehci->regs->command);

    /* If the EHCI debug controller is active, special care must be
     * taken before and after a host controller reset */
    if (ehci->debug && !dbgp_reset_prep())
        ehci->debug = NULL;

    USB_vdebug("ehci reset...\n");
    command |= CMD_RESET;
    dbg_cmd (ehci, "reset", command);
    ehci_writel(ehci, command, &ehci->regs->command);
    ehci->rh_state = EHCI_RH_HALTED;
    ehci->next_statechange = jiffies;
    retval = handshake (ehci, &ehci->regs->command,
                        CMD_RESET, 0, 250 * 1000);

    if (ehci->has_hostpc) {
        ehci_writel(ehci, USBMODE_EX_HC | USBMODE_EX_VBPS,
                    (u32 __iomem *)(((u8 *)ehci->regs) + USBMODE_EX));
        ehci_writel(ehci, TXFIFO_DEFAULT,
                    (u32 __iomem *)(((u8 *)ehci->regs) + TXFILLTUNING));
    }
    if (retval)
        return retval;

    if (ehci_is_TDI(ehci))
        tdi_reset (ehci);

    if (ehci->debug)
        dbgp_external_startup();

    return retval;
}

/* idle the controller (from running) */
static void ehci_quiesce (struct ehci_hcd *ehci)
{
    u32 temp;

#ifdef DEBUG
    if (ehci->rh_state != EHCI_RH_RUNNING)
        BUG ();
#endif

    /* wait for any schedule enables/disables to take effect */
    temp = ehci_readl(ehci, &ehci->regs->command) << 10;
    temp &= STS_ASS | STS_PSS;
    if (handshake_on_error_set_halt(ehci, &ehci->regs->status,
                                    STS_ASS | STS_PSS, temp, 16 * 125))
        return;

    /* then disable anything that's still active */
    temp = ehci_readl(ehci, &ehci->regs->command);
    temp &= ~(CMD_ASE | CMD_IAAD | CMD_PSE);
    ehci_writel(ehci, temp, &ehci->regs->command);

    /* hardware can take 16 microframes to turn off ... */
    handshake_on_error_set_halt(ehci, &ehci->regs->status,
                                STS_ASS | STS_PSS, 0, 16 * 125);
}

/*-------------------------------------------------------------------------*/

static void end_unlink_async(struct ehci_hcd *ehci);
static void ehci_work(struct ehci_hcd *ehci);

#include "ehci-hub.c"
//#include "ehci-lpm.c"
#include "ehci-mem.c"
#include "ehci-q.c"
#include "ehci-sched.c"
//#include "ehci-sysfs.c"

/*-------------------------------------------------------------------------*/

#if 0
static void ehci_iaa_watchdog(unsigned long param)
{
    struct ehci_hcd     *ehci = (struct ehci_hcd *) param;
    unsigned long       flags;

    spin_lock_irqsave (&ehci->lock, flags);

    /* Lost IAA irqs wedge things badly; seen first with a vt8235.
     * So we need this watchdog, but must protect it against both
     * (a) SMP races against real IAA firing and retriggering, and
     * (b) clean HC shutdown, when IAA watchdog was pending.
     */
    if (ehci->reclaim
            && !timer_pending(&ehci->iaa_watchdog)
            && ehci->rh_state == EHCI_RH_RUNNING) {
        u32 cmd, status;

        /* If we get here, IAA is *REALLY* late.  It's barely
         * conceivable that the system is so busy that CMD_IAAD
         * is still legitimately set, so let's be sure it's
         * clear before we read STS_IAA.  (The HC should clear
         * CMD_IAAD when it sets STS_IAA.)
         */
        cmd = ehci_readl(ehci, &ehci->regs->command);
        if (cmd & CMD_IAAD)
            ehci_writel(ehci, cmd & ~CMD_IAAD,
                        &ehci->regs->command);

        /* If IAA is set here it either legitimately triggered
         * before we cleared IAAD above (but _way_ late, so we'll
         * still count it as lost) ... or a silicon erratum:
         * - VIA seems to set IAA without triggering the IRQ;
         * - IAAD potentially cleared without setting IAA.
         */
        status = ehci_readl(ehci, &ehci->regs->status);
        if ((status & STS_IAA) || !(cmd & CMD_IAAD)) {
            COUNT (ehci->stats.lost_iaa);
            ehci_writel(ehci, STS_IAA, &ehci->regs->status);
        }

        ehci_vdbg(ehci, "IAA watchdog: status %x cmd %x\n",
                  status, cmd);
        end_unlink_async(ehci);
    }

    spin_unlock_irqrestore(&ehci->lock, flags);
}
#endif


//static void ehci_watchdog(unsigned long param)
#if 1
void ehci_watchdog()
{
    struct ehci_hcd     *ehci;
    //unsigned long     flags;

