OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ehci-hcd.c
    ehci = hcd_to_ehci(_g_ehci_usb_hcd);    // (struct ehci_hcd *) param;

    spin_lock_irqsave(&ehci->lock, flags);

    /* stop async processing after it's idled a bit */
    if (test_bit (TIMER_ASYNC_OFF, &ehci->actions))
        start_unlink_async (ehci, ehci->async);

    /* ehci could run by timer, without IRQs ... */
    ehci_work (ehci);

    spin_unlock_irqrestore (&ehci->lock, flags);
}
#else
void ehci_watchdog()
{
    struct ehci_hcd     *ehci;
    //unsigned long     flags;

    ehci = hcd_to_ehci(_g_ehci_usb_hcd);    // (struct ehci_hcd *) param;

    spin_lock_irqsave(&ehci->lock, flags);

    /* stop async processing after it's idled a bit */
    if (test_bit (TIMER_ASYNC_OFF, &ehci->actions))
        start_unlink_async (ehci, ehci->async);

    /* ehci could run by timer, without IRQs ... */
    ehci_work (ehci);

    spin_unlock_irqrestore (&ehci->lock, flags);
}
#endif

/* On some systems, leaving remote wakeup enabled prevents system shutdown.
 * The firmware seems to think that powering off is a wakeup event!
 * This routine turns off remote wakeup and everything else, on all ports.
 */
static void ehci_turn_off_all_ports(struct ehci_hcd *ehci)
{
    int port;

    port = HCS_N_PORTS(ehci->hcs_params);

    while (port--)
        ehci_writel(ehci, PORT_RWC_BITS,
                    &ehci->regs->port_status[port]);
}

/*
 * Halt HC, turn off all ports, and let the BIOS use the companion controllers.
 * Should be called with ehci->lock held.
 */
static void ehci_silence_controller(struct ehci_hcd *ehci)
{
    ehci_halt(ehci);
    ehci_turn_off_all_ports(ehci);

    /* make BIOS/etc use companion controller during reboot */
    ehci_writel(ehci, 0, &ehci->regs->configured_flag);

    /* unblock posted writes */
    ehci_readl(ehci, &ehci->regs->configured_flag);
}


#if 0
/* ehci_shutdown kick in for silicon on any bus (not just pci, etc).
 * This forcibly disables dma and IRQs, helping kexec and other cases
 * where the next system software may expect clean state.
 */
static void ehci_shutdown(struct usb_hcd *hcd)
{
    struct ehci_hcd *ehci;

    ehci = hcd_to_ehci(hcd);

    //del_timer_sync(&ehci->watchdog);
    //del_timer_sync(&ehci->iaa_watchdog);

    spin_lock_irq(&ehci->lock);
    ehci_silence_controller(ehci);
    spin_unlock_irq(&ehci->lock);
}
#endif


static void ehci_port_power (struct ehci_hcd *ehci, int is_on)
{
    unsigned port;

    if (!HCS_PPC (ehci->hcs_params))
        return;

    USB_debug("...power%s ports...\n", is_on ? "up" : "down");
    for (port = HCS_N_PORTS (ehci->hcs_params); port > 0; )
        (void) ehci_hub_control(ehci_to_hcd(ehci),
                                is_on ? SetPortFeature : ClearPortFeature,
                                USB_PORT_FEAT_POWER,
                                port--, NULL, 0);
    /* Flush those writes */
    ehci_readl(ehci, &ehci->regs->command);
    msleep(20);
}

/*-------------------------------------------------------------------------*/

/*
 * ehci_work is called from some interrupts, timers, and so on.
 * it calls driver completion functions, after dropping ehci->lock.
 */
static void ehci_work (struct ehci_hcd *ehci)
{
    timer_action_done (ehci, TIMER_IO_WATCHDOG);

    /* another CPU may drop ehci->lock during a schedule scan while
     * it reports urb completions.  this flag guards against bogus
     * attempts at re-entrant schedule scanning.
     */
    if (ehci->scanning)
        return;
    ehci->scanning = 1;
    scan_async (ehci);
    if (ehci->next_uframe != -1) {
        scan_periodic (ehci);
    }
    ehci->scanning = 0;

    /* the IO watchdog guards against hardware or driver bugs that
     * misplace IRQs, and should let us run completely without IRQs.
     * such lossage has been observed on both VT6202 and VT8235.
     */
    //if (ehci->rh_state == EHCI_RH_RUNNING &&
    //      (ehci->async->qh_next.ptr != NULL ||
    //       ehci->periodic_sched != 0))
    //  timer_action (ehci, TIMER_IO_WATCHDOG);
}

/*
 * Called when the ehci_hcd module is removed.
 */
static void ehci_stop (struct usb_hcd *hcd)
{
    struct ehci_hcd     *ehci;

    ehci = hcd_to_ehci (hcd);

    USB_debug("stop\n");

    /* no more interrupts ... */
    //del_timer_sync (&ehci->watchdog);
    //del_timer_sync(&ehci->iaa_watchdog);

    spin_lock_irq(&ehci->lock);
    if (ehci->rh_state == EHCI_RH_RUNNING)
        ehci_quiesce (ehci);

    ehci_silence_controller(ehci);
    ehci_reset (ehci);
    spin_unlock_irq(&ehci->lock);

    //remove_sysfs_files(ehci);
    //remove_debug_files (ehci);

    /* root hub is shut down separately (first, when possible) */
    spin_lock_irq (&ehci->lock);
    if (ehci->async)
        ehci_work (ehci);
    spin_unlock_irq (&ehci->lock);
    ehci_mem_cleanup (ehci);

    //if (ehci->amd_pll_fix == 1)
    //  usb_amd_dev_put();

#ifdef  EHCI_STATS
    USB_debug("irq normal %ld err %ld reclaim %ld (lost %ld)\n",
              ehci->stats.normal, ehci->stats.error, ehci->stats.reclaim,
              ehci->stats.lost_iaa);
    USB_debug("complete %ld unlink %ld\n",
              ehci->stats.complete, ehci->stats.unlink);
#endif

    dbg_status (ehci, "ehci_stop completed",
                ehci_readl(ehci, &ehci->regs->status));
}

/* one-time init, only for memory state */
static int ehci_init(struct usb_hcd *hcd)
{
    struct ehci_hcd     *ehci;
    u32         temp;
    int         retval;
    u32         hcc_params;
    struct ehci_qh_hw   *hw;

    ehci = hcd_to_ehci(hcd);

#ifdef NUVOTON_PORTED
    ehci->use_dummy_qh = 0;
#endif

    //spin_lock_init(&ehci->lock);

    /*
     * keep io watchdog by default, those good HCDs could turn off it later
     */
    //ehci->need_io_watchdog = 1;
    //init_timer(&ehci->watchdog);
    //ehci->watchdog.function = ehci_watchdog;
    //ehci->watchdog.data = (unsigned long) ehci;

    //init_timer(&ehci->iaa_watchdog);
    //ehci->iaa_watchdog.function = ehci_iaa_watchdog;
    //ehci->iaa_watchdog.data = (unsigned long) ehci;

    hcc_params = ehci_readl(ehci, &ehci->caps->hcc_params);

