OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ehci-hcd.c
    /*
     * by default set standard 80% (== 100 usec/uframe) max periodic
     * bandwidth as required by USB 2.0
     */
    ehci->uframe_periodic_max = 100;

    /*
     * hw default: 1K periodic list heads, one per frame.
     * periodic_size can shrink by USBCMD update if hcc_params allows.
     */
    ehci->periodic_size = DEFAULT_I_TDPS;
    INIT_LIST_HEAD(&ehci->cached_itd_list);
    INIT_LIST_HEAD(&ehci->cached_sitd_list);

    if (HCC_PGM_FRAMELISTLEN(hcc_params)) {
        /* periodic schedule size can be smaller than default */
        switch (EHCI_TUNE_FLS) {
        case 0:
            ehci->periodic_size = 1024;
            break;
        case 1:
            ehci->periodic_size = 512;
            break;
        case 2:
            ehci->periodic_size = 256;
            break;
        default:
            BUG();
        }
    }
    if ((retval = ehci_mem_init(ehci, GFP_KERNEL)) < 0)
        return retval;

    /* controllers may cache some of the periodic schedule ... */
    if (HCC_ISOC_CACHE(hcc_params))     // full frame cache
        ehci->i_thresh = 2 + 8;
    else                    // N microframes cached
        ehci->i_thresh = 2 + HCC_ISOC_THRES(hcc_params);

    ehci->reclaim = NULL;
    ehci->next_uframe = -1;
    ehci->clock_frame = 0xFFFFFFFF;

    /*
     * dedicate a qh for the async ring head, since we couldn't unlink
     * a 'real' qh without stopping the async schedule [4.8].  use it
     * as the 'reclamation list head' too.
     * its dummy is used in hw_alt_next of many tds, to prevent the qh
     * from automatically advancing to the next td after short reads.
     */
    ehci->async->qh_next.qh = NULL;
    hw = ehci->async->hw;
    hw->hw_next = QH_NEXT(ehci, ehci->async->qh_dma);
    hw->hw_info1 = cpu_to_hc32(ehci, QH_HEAD);
    hw->hw_token = cpu_to_hc32(ehci, QTD_STS_HALT);
    hw->hw_qtd_next = EHCI_LIST_END(ehci);
    ehci->async->qh_state = QH_STATE_LINKED;
    hw->hw_alt_next = QTD_NEXT(ehci, ehci->async->dummy->qtd_dma);

    /* clear interrupt enables, set irq latency */
    if (log2_irq_thresh < 0 || log2_irq_thresh > 6)
        log2_irq_thresh = 0;
    temp = 1 << (16 + log2_irq_thresh);
    if (HCC_PER_PORT_CHANGE_EVENT(hcc_params)) {
        ehci->has_ppcd = 1;
        USB_debug("enable per-port change event\n");
        temp |= CMD_PPCEE;
    }
    if (HCC_CANPARK(hcc_params)) {
        /* HW default park == 3, on hardware that supports it (like
         * NVidia and ALI silicon), maximizes throughput on the async
         * schedule by avoiding QH fetches between transfers.
         *
         * With fast usb storage devices and NForce2, "park" seems to
         * make problems:  throughput reduction (!), data errors...
         */
        if (park) {
            park = min(park, (unsigned) 3);
            temp |= CMD_PARK;
            temp |= park << 8;
        }
        USB_debug("park %d\n", park);
    }
    if (HCC_PGM_FRAMELISTLEN(hcc_params)) {
        /* periodic schedule size can be smaller than default */
        temp &= ~(3 << 2);
        temp |= (EHCI_TUNE_FLS << 2);
    }
    if (HCC_LPM(hcc_params)) {
        /* support link power management EHCI 1.1 addendum */
        USB_debug("support lpm\n");
        ehci->has_lpm = 1;
        if (hird > 0xf) {
            USB_debug("hird %d invalid, use default 0",
                      hird);
            hird = 0;
        }
        temp |= hird << 24;
    }
    ehci->command = temp;

    /* Accept arbitrarily long scatter-gather lists */
    if (!(hcd->driver->flags & HCD_LOCAL_MEM))
        hcd->self.sg_tablesize = ~0;

    g_m480_ehci = ehci;
    return 0;
}

/* start HC running; it's halted, ehci_init() has been run (once) */
static int ehci_run (struct usb_hcd *hcd)
{
    struct ehci_hcd  *ehci;
    int         retval;
    u32         hcc_params;
#ifdef DEBUG
    u32         temp;
#endif

    ehci = hcd_to_ehci (hcd);
    hcd->uses_new_polling = 1;

    /* EHCI spec section 4.1 */
    /*
     * TDI driver does the ehci_reset in their reset callback.
     * Don't reset here, because configuration settings will
     * vanish.
     */
    if (!ehci_is_TDI(ehci) && (retval = ehci_reset(ehci)) != 0) {
        ehci_mem_cleanup(ehci);
        return retval;
    }
    ehci_writel(ehci, ehci->periodic_dma, &ehci->regs->frame_list);
    ehci_writel(ehci, (u32)ehci->async->qh_dma, &ehci->regs->async_next);

    /*
     * hcc_params controls whether ehci->regs->segment must (!!!)
     * be used; it constrains QH/ITD/SITD and QTD locations.
     * pci_pool consistent memory always uses segment zero.
     * streaming mappings for I/O buffers, like pci_map_single(),
     * can return segments above 4GB, if the device allows.
     *
     * NOTE:  the dma mask is visible through dma_supported(), so
     * drivers can pass this info along ... like NETIF_F_HIGHDMA,
     * Scsi_Host.highmem_io, and so forth.  It's readonly to all
     * host side drivers though.
     */
    hcc_params = ehci_readl(ehci, &ehci->caps->hcc_params);
    if (HCC_64BIT_ADDR(hcc_params)) {
        ehci_writel(ehci, 0, &ehci->regs->segment);
#if 0
// this is deeply broken on almost all architectures
        if (!dma_set_mask(hcd->self.controller, DMA_BIT_MASK(64)))
            USB_debug("enabled 64bit DMA\n");
#endif
    }


    // Philips, Intel, and maybe others need CMD_RUN before the
    // root hub will detect new devices (why?); NEC doesn't
    ehci->command &= ~(CMD_LRESET|CMD_IAAD|CMD_PSE|CMD_ASE|CMD_RESET);
    ehci->command |= CMD_RUN;
    ehci_writel(ehci, ehci->command, &ehci->regs->command);
    dbg_cmd (ehci, "init", ehci->command);

    /*
     * Start, enabling full USB 2.0 functionality ... usb 1.1 devices
     * are explicitly handed to companion controller(s), so no TT is
     * involved with the root hub.  (Except where one is integrated,
     * and there's no companion controller unless maybe for USB OTG.)
     *
     * Turning on the CF flag will transfer ownership of all ports
     * from the companions to the EHCI controller.  If any of the
     * companions are in the middle of a port reset at the time, it
     * could cause trouble.  Write-locking ehci_cf_port_reset_rwsem
     * guarantees that no resets are in progress.  After we set CF,
     * a short delay lets the hardware catch up; new resets shouldn't
     * be started before the port switching actions could complete.
     */
    //down_write(&ehci_cf_port_reset_rwsem);
    ehci->rh_state = EHCI_RH_RUNNING;
    ehci_writel(ehci, FLAG_CF, &ehci->regs->configured_flag);
    ehci_readl(ehci, &ehci->regs->command); /* unblock posted writes */
    msleep(5);
    //up_write(&ehci_cf_port_reset_rwsem);
    //ehci->last_periodic_enable = ktime_get_real();

#ifdef DEBUG
    temp = HC_VERSION(ehci, ehci_readl(ehci, &ehci->caps->hc_capbase));
    USB_debug("USB %x.%x started, EHCI %x.%02x%s\n",
              ((ehci->sbrn & 0xf0)>>4), (ehci->sbrn & 0x0f),
              temp >> 8, temp & 0xff,
              ignore_oc ? ", overcurrent ignored" : "");
#endif

    ehci_writel(ehci, INTR_MASK,
                &ehci->regs->intr_enable); /* Turn On Interrupts */

    /* GRR this is run-once init(), being done every time the HC starts.
     * So long as they're part of class devices, we can't do it init()
     * since the class device isn't created that early.
     */
    //create_debug_files(ehci);
    //create_sysfs_files(ehci);

