OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ehci-hcd.c
    return 0;
}


/*-------------------------------------------------------------------------*/

//static irqreturn_t ehci_irq (struct usb_hcd *hcd)
void EHCI_IRQHandler(void)
{
    struct usb_hcd   *hcd;
    struct ehci_hcd  *ehci;
    u32         status, masked_status, cmd;
//  u32         pcd_status = 0;
    int         bh;

    ehci = g_m480_ehci;
    hcd = ehci_to_hcd (ehci);

    if (hcd == NULL)
        return;

    _IsInUsbInterrupt = 1;

    spin_lock (&ehci->lock);

    status = ehci_readl(ehci, &ehci->regs->status);
    //USB_debug("irq status=0x%x\n", status);

    /* e.g. cardbus physical eject */
    if (status == ~(u32) 0) {
        USB_debug("device removed\n");
        goto dead;
    }

    /* Shared IRQ? */
    masked_status = status & INTR_MASK;
    if (!masked_status || unlikely(ehci->rh_state == EHCI_RH_HALTED)) {
        spin_unlock(&ehci->lock);
        _IsInUsbInterrupt = 0;
        return ;    // IRQ_NONE;
    }

    /* clear (just) interrupts */
    ehci_writel(ehci, masked_status, &ehci->regs->status);
    cmd = ehci_readl(ehci, &ehci->regs->command);
    bh = 0;

#ifdef  VERBOSE_DEBUG
    /* unrequested/ignored: Frame List Rollover */
    dbg_status (ehci, "irq", status);
#endif

    /* int, ERR, and IAA interrupt rates can be throttled */

    /* normal [4.15.1.2] or error [4.15.1.1] completion */
    if (likely ((status & (STS_INT|STS_ERR)) != 0)) {
        if (likely ((status & STS_ERR) == 0))
            COUNT (ehci->stats.normal);
        else
            COUNT (ehci->stats.error);
        bh = 1;
    }

    /* complete the unlinking of some qh [4.15.2.3] */
    if (status & STS_IAA) {
        /* guard against (alleged) silicon errata */
        if (cmd & CMD_IAAD) {
            ehci_writel(ehci, cmd & ~CMD_IAAD,
                        &ehci->regs->command);
            USB_debug("IAA with IAAD still set?\n");
        }
        if (ehci->reclaim) {
            COUNT(ehci->stats.reclaim);
            end_unlink_async(ehci);
        } else
            USB_debug("IAA with nothing to reclaim?\n");
    }

    /* remote wakeup [4.3.1] */
    if (status & STS_PCD) {
        unsigned    i = HCS_N_PORTS (ehci->hcs_params);
        u32     ppcd = 0;

        /* kick root hub later */
        //pcd_status = status;

        /* resume root hub? */
        if (!(cmd & CMD_RUN))
            usb_hcd_resume_root_hub(hcd);

        /* get per-port change detect bits */
        if (ehci->has_ppcd)
            ppcd = status >> 16;

        while (i--) {
            int pstatus;

            /* leverage per-port change bits feature */
            if (ehci->has_ppcd && !(ppcd & (1 << i)))
                continue;
            pstatus = ehci_readl(ehci,
                                 &ehci->regs->port_status[i]);

            if (pstatus & PORT_OWNER)
                continue;
            if (!(test_bit(i, &ehci->suspended_ports) &&
                    ((pstatus & PORT_RESUME) ||
                     !(pstatus & PORT_SUSPEND)) &&
                    (pstatus & PORT_PE) &&
                    ehci->reset_done[i] == 0))
                continue;

            /* start 20 msec resume signaling from this port,
             * and make khubd collect PORT_STAT_C_SUSPEND to
             * stop that signaling.  Use 5 ms extra for safety,
             * like usb_port_resume() does.
             */
            ehci->reset_done[i] = jiffies + msecs_to_jiffies(25);
            USB_debug("port %d remote wakeup\n", i + 1);
            //mod_timer(&hcd->rh_timer, ehci->reset_done[i]);
        }
    }

    /* PCI errors [4.15.2.4] */
    if (unlikely ((status & STS_FATAL) != 0)) {
        USB_error("fatal error\n");
        dbg_cmd(ehci, "fatal", cmd);
        dbg_status(ehci, "fatal", status);
        ehci_halt(ehci);
dead:
        ehci_reset(ehci);
        ehci_writel(ehci, 0, &ehci->regs->configured_flag);
        usb_hc_died(hcd);
        /* generic layer kills/unlinks all urbs, then
         * uses ehci_stop to clean up the rest
         */
        bh = 1;
    }

    if (bh) {
        ehci_work (ehci);
    }
    spin_unlock (&ehci->lock);

    _IsInUsbInterrupt = 0;

    //if (pcd_status)
    //  usb_hcd_poll_rh_status(hcd);
    return ;    // IRQ_HANDLED;
}

/*-------------------------------------------------------------------------*/

/*
 * non-error returns are a promise to giveback() the urb later
 * we drop ownership so next owner (or urb unlink) can get it
 *
 * urb + dev is in hcd.self.controller.urb_list
 * we're queueing TDs onto software and hardware lists
 *
 * hcd-specific init for hcpriv hasn't been done yet
 *
 * NOTE:  control, bulk, and interrupt share the same code to append TDs
 * to a (possibly active) QH, and the same QH scanning code.
 */
static int ehci_urb_enqueue (
    struct usb_hcd  *hcd,
    struct urb  *urb,
    gfp_t       mem_flags
)
{
    struct ehci_hcd     *ehci;
    struct list_head    qtd_list;
    int  retval;

    ehci = hcd_to_ehci (hcd);

    INIT_LIST_HEAD (&qtd_list);
    switch (usb_pipetype (urb->pipe)) {
    case PIPE_CONTROL:
        /* qh_completions() code doesn't handle all the fault cases
         * in multi-TD control transfers.  Even 1KB is rare anyway.
         */
        if (urb->transfer_buffer_length > (16 * 1024))
            return -EMSGSIZE;
    /* FALLTHROUGH */
    /* case PIPE_BULK: */
    default:
        if (!qh_urb_transaction (ehci, urb, &qtd_list, mem_flags))
            return -ENOMEM;
        retval = submit_async(ehci, urb, &qtd_list, mem_flags);
        return retval;

    case PIPE_INTERRUPT:
        if (!qh_urb_transaction (ehci, urb, &qtd_list, mem_flags))
            return -ENOMEM;
        return intr_submit(ehci, urb, &qtd_list, mem_flags);

    case PIPE_ISOCHRONOUS:
        if (urb->dev->speed == USB_SPEED_HIGH)
            return itd_submit (ehci, urb, mem_flags);
        else
            return sitd_submit (ehci, urb, mem_flags);
    }
}

static void unlink_async (struct ehci_hcd *ehci, struct ehci_qh *qh)
{
    /* failfast */
    if (ehci->rh_state != EHCI_RH_RUNNING && ehci->reclaim)
        end_unlink_async(ehci);

