OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ehci-hcd.c
    /* If the QH isn't linked then there's nothing we can do
     * unless we were called during a giveback, in which case
     * qh_completions() has to deal with it.
     */
    if (qh->qh_state != QH_STATE_LINKED) {
        if (qh->qh_state == QH_STATE_COMPLETING)
            qh->needs_rescan = 1;
        return;
    }

    /* defer till later if busy */
    if (ehci->reclaim) {
        struct ehci_qh      *last;

        for (last = ehci->reclaim;
                last->reclaim;
                last = last->reclaim)
            continue;
        qh->qh_state = QH_STATE_UNLINK_WAIT;
        last->reclaim = qh;

        /* start IAA cycle */
    } else
        start_unlink_async (ehci, qh);
}

/* remove from hardware lists
 * completions normally happen asynchronously
 */

static int ehci_urb_dequeue(struct usb_hcd *hcd, struct urb *urb, int status)
{
    struct ehci_hcd     *ehci;
    struct ehci_qh      *qh;
    //unsigned long     flags;
    int         rc;

    ehci = hcd_to_ehci (hcd);

    spin_lock_irqsave (&ehci->lock, flags);
    rc = usb_hcd_check_unlink_urb(hcd, urb, status);
    if (rc)
        goto done;

    switch (usb_pipetype (urb->pipe)) {
    // case PIPE_CONTROL:
    // case PIPE_BULK:
    default:
        qh = (struct ehci_qh *) urb->hcpriv;
        if (!qh)
            break;
        switch (qh->qh_state) {
        case QH_STATE_LINKED:
        case QH_STATE_COMPLETING:
            unlink_async(ehci, qh);
            break;
        case QH_STATE_UNLINK:
        case QH_STATE_UNLINK_WAIT:
            /* already started */
            break;
        case QH_STATE_IDLE:
            /* QH might be waiting for a Clear-TT-Buffer */
            qh_completions(ehci, qh);
            break;
        }
        break;

    case PIPE_INTERRUPT:
        qh = (struct ehci_qh *) urb->hcpriv;
        if (!qh)
            break;
        switch (qh->qh_state) {
        case QH_STATE_LINKED:
        case QH_STATE_COMPLETING:
            intr_deschedule (ehci, qh);
            break;
        case QH_STATE_IDLE:
            qh_completions (ehci, qh);
            break;
        default:
            USB_debug("bogus qh %p state %d\n", qh, qh->qh_state);
            goto done;
        }
        break;

    case PIPE_ISOCHRONOUS:
        // itd or sitd ...

        // wait till next completion, do it then.
        // completion irqs can wait up to 1024 msec,
        break;
    }
done:
    spin_unlock_irqrestore (&ehci->lock, flags);
    return rc;
}

/*-------------------------------------------------------------------------*/

// bulk qh holds the data toggle

static void
ehci_endpoint_disable (struct usb_hcd *hcd, struct usb_host_endpoint *ep)
{
    struct ehci_hcd     *ehci;
    //unsigned long     flags;
    struct ehci_qh      *qh, *tmp;

    ehci = hcd_to_ehci (hcd);

    /* ASSERT:  any requests/urbs are being unlinked */
    /* ASSERT:  nobody can be submitting urbs for this any more */

rescan:
    spin_lock_irqsave (&ehci->lock, flags);
    qh = ep->hcpriv;
    if (!qh)
        goto done;

    /* endpoints can be iso streams.  for now, we don't
     * accelerate iso completions ... so spin a while.
     */
    if (qh->hw == NULL) {
        ehci_vdbg (ehci, "iso delay\n");
        goto idle_timeout;
    }

    if (ehci->rh_state != EHCI_RH_RUNNING)
        qh->qh_state = QH_STATE_IDLE;
    switch (qh->qh_state) {
    case QH_STATE_LINKED:
    case QH_STATE_COMPLETING:
        for (tmp = ehci->async->qh_next.qh;
                tmp && tmp != qh;
                tmp = tmp->qh_next.qh)
            continue;
        /* periodic qh self-unlinks on empty, and a COMPLETING qh
         * may already be unlinked.
         */
        if (tmp)
            unlink_async(ehci, qh);
    /* FALL THROUGH */
    case QH_STATE_UNLINK:       /* wait for hw to finish? */
    case QH_STATE_UNLINK_WAIT:
idle_timeout:
        spin_unlock_irqrestore (&ehci->lock, flags);
        //schedule_timeout_uninterruptible(1);
        goto rescan;
    case QH_STATE_IDLE:     /* fully unlinked */
        if (qh->clearing_tt)
            goto idle_timeout;
        if (list_empty (&qh->qtd_list)) {
            qh_put (qh);
            break;
        }
    /* else FALL THROUGH */
    default:
        /* caller was supposed to have unlinked any requests;
         * that's not our job.  just leak this memory.
         */
        USB_error("qh %p (#%02x) state %d%s\n",
                  qh, ep->desc.bEndpointAddress, qh->qh_state,
                  list_empty (&qh->qtd_list) ? "" : "(has tds)");
        break;
    }
    ep->hcpriv = NULL;
done:
    spin_unlock_irqrestore (&ehci->lock, flags);
}


#if 0
static void  ehci_endpoint_reset(struct usb_hcd *hcd, struct usb_host_endpoint *ep)
{
    struct ehci_hcd     *ehci;
    struct ehci_qh      *qh;
    int     eptype;
    int     epnum;
    int     is_out;
    //unsigned long     flags;

    ehci = hcd_to_ehci(hcd);
    eptype = usb_endpoint_type(&ep->desc);
    epnum = usb_endpoint_num(&ep->desc);
    is_out = usb_endpoint_dir_out(&ep->desc);

    if (eptype != USB_ENDPOINT_XFER_BULK && eptype != USB_ENDPOINT_XFER_INT)
        return;

    spin_lock_irqsave(&ehci->lock, flags);
    qh = ep->hcpriv;

    /* For Bulk and Interrupt endpoints we maintain the toggle state
     * in the hardware; the toggle bits in udev aren't used at all.
     * When an endpoint is reset by usb_clear_halt() we must reset
     * the toggle bit in the QH.
     */
    if (qh) {
        usb_settoggle(qh->dev, epnum, is_out, 0);
        if (!list_empty(&qh->qtd_list)) {
            USB_debug("clear_halt for a busy endpoint\n");
        } else if (qh->qh_state == QH_STATE_LINKED ||
                   qh->qh_state == QH_STATE_COMPLETING) {

            /* The toggle value in the QH can't be updated
             * while the QH is active.  Unlink it now;
             * re-linking will call qh_refresh().
             */
            if (eptype == USB_ENDPOINT_XFER_BULK)
                unlink_async(ehci, qh);
            else
                intr_deschedule(ehci, qh);
        }
    }
    spin_unlock_irqrestore(&ehci->lock, flags);
}
#endif

static int ehci_get_frame (struct usb_hcd *hcd)
{
    struct ehci_hcd *ehci;
    ehci = hcd_to_ehci (hcd);
    return (ehci_read_frame_index(ehci) >> 3) % ehci->periodic_size;
}

/*-------------------------------------------------------------------------*/

#include "ehci-m480.c"

