OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ehci-hcd.c
#if 0

static int __init ehci_hcd_init(void)
{
    int retval = 0;

    if (usb_disabled())
        return -ENODEV;

    printk(KERN_INFO "%s: " DRIVER_DESC "\n", hcd_name);
    set_bit(USB_EHCI_LOADED, &usb_hcds_loaded);
    if (test_bit(USB_UHCI_LOADED, &usb_hcds_loaded) ||
            test_bit(USB_OHCI_LOADED, &usb_hcds_loaded))
        printk(KERN_WARNING "Warning! ehci_hcd should always be loaded"
               " before uhci_hcd and ohci_hcd, not after\n");

    pr_debug("%s: block sizes: qh %Zd qtd %Zd itd %Zd sitd %Zd\n",
             hcd_name,
             sizeof(struct ehci_qh), sizeof(struct ehci_qtd),
             sizeof(struct ehci_itd), sizeof(struct ehci_sitd));

#ifdef DEBUG
    ehci_debug_root = debugfs_create_dir("ehci", usb_debug_root);
    if (!ehci_debug_root) {
        retval = -ENOENT;
        goto err_debug;
    }
#endif

#ifdef PLATFORM_DRIVER
    retval = platform_driver_register(&PLATFORM_DRIVER);
    if (retval < 0)
        goto clean0;
#endif

#ifdef PCI_DRIVER
    retval = pci_register_driver(&PCI_DRIVER);
    if (retval < 0)
        goto clean1;
#endif

#ifdef PLATFORM_DRIVER
    platform_driver_unregister(&PLATFORM_DRIVER);
clean0:
#endif
    clear_bit(USB_EHCI_LOADED, &usb_hcds_loaded);
    return retval;
}
module_init(ehci_hcd_init);

static void __exit ehci_hcd_cleanup(void)
{
#ifdef XILINX_OF_PLATFORM_DRIVER
    platform_driver_unregister(&XILINX_OF_PLATFORM_DRIVER);
#endif
#ifdef OF_PLATFORM_DRIVER
    platform_driver_unregister(&OF_PLATFORM_DRIVER);
#endif
#ifdef PLATFORM_DRIVER
    platform_driver_unregister(&PLATFORM_DRIVER);
#endif
#ifdef PCI_DRIVER
    pci_unregister_driver(&PCI_DRIVER);
#endif
    clear_bit(USB_EHCI_LOADED, &usb_hcds_loaded);
}
module_exit(ehci_hcd_cleanup);

#endif
